# Arithmetic Operations in Pandas

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
s1=pd.Series(np.arange(4),
             index=["a","c","d","e"])
s2=pd.Series(np.arange(5),
             index=["a","c","e","f","g"])

In [ ]:
print(s1)
print(s2)

a    0
c    1
d    2
e    3
dtype: int32
a    0
c    1
e    2
f    3
g    4
dtype: int32

In [ ]:
s1+s2

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [ ]:
df1=pd.DataFrame(
    np.arange(6).reshape(2,3),
    columns=list("ABC"),
    index=["Tim","Tom"])
df2=pd.DataFrame(
    np.arange(9).reshape(3,3),
    columns=list("ACD"),
    index=["Tim","Kate","Tom"])

In [ ]:
print(df1)
print(df2)

     A  B  C
Tim  0  1  2
Tom  3  4  5
      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [ ]:
df1+df2

        A   B     C   D
Kate  NaN NaN   NaN NaN
Tim   0.0 NaN   3.0 NaN
Tom   9.0 NaN  12.0 NaN

In [ ]:
df1.add(df2,fill_value=0)

        A    B     C    D
Kate  3.0  NaN   4.0  5.0
Tim   0.0  1.0   3.0  2.0
Tom   9.0  4.0  12.0  8.0

In [ ]:
1/df1

            A     B    C
Tim       inf  1.00  0.5
Tom  0.333333  0.25  0.2

In [ ]:
df1*3

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [ ]:
df1.mul(3)

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [ ]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [ ]:
s=df2.iloc[1]
s

A    3
C    4
D    5
Name: Kate, dtype: int32

In [ ]:
df2-s

      A  C  D
Tim  -3 -3 -3
Kate  0  0  0
Tom   3  3  3

In [ ]:
s2=df2["A"]
s2

Tim     0
Kate    3
Tom     6
Name: A, dtype: int32

In [ ]:
df2.sub(s2,axis="index")

      A  C  D
Tim   0  1  2
Kate  0  1  2
Tom   0  1  2

## Applying a Function

In [ ]:
df=pd.DataFrame(
    np.random.randn(4,3),
    columns=list("ABC"),
    index=["Kim","Susan","Tim","Tom"])
df

              A         B         C
Kim   -0.173717 -1.126917 -0.595042
Susan -0.641672 -0.073913 -1.828588
Tim   -0.389124 -1.786140  0.553646
Tom   -0.062436 -0.251933  0.872391

In [ ]:
np.abs(df)

              A         B         C
Kim    0.173717  1.126917  0.595042
Susan  0.641672  0.073913  1.828588
Tim    0.389124  1.786140  0.553646
Tom    0.062436  0.251933  0.872391

In [ ]:
f=lambda x:x.max()-x.min()

In [ ]:
df.apply(f)

A    0.579236
B    1.712227
C    2.700979
dtype: float64

In [ ]:
df.apply(f,axis=1)

Kim      0.953200
Susan    1.754676
Tim      2.339785
Tom      1.124324
dtype: float64

In [ ]:
def f(x):
    return x**2

In [ ]:
df.apply(f)

              A         B         C
Kim    0.030178  1.269942  0.354075
Susan  0.411743  0.005463  3.343735
Tim    0.151417  3.190294  0.306524
Tom    0.003898  0.063470  0.761066